Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/account.po
Languages: it

source: 6. Accounts
it: 6. Conti

source: 6.1 Navigating to Accounts
it: 6.1 Navigazione nei Conti

source: To access the "Accounts" section:
it: Per accedere alla sezione "Conti":

source: **Home Page**: Start from the PantaSys home page.
it: **Pagina principale**: Inizia dalla pagina principale di PantaSys.

source: **Sidebar Menu**: Locate the sidebar menu on the left-hand side.
it: **Menu laterale**: Trova il menu laterale sul lato sinistro.

source: **Accounts Menu Item**: Click on the "Accounts" menu item to expand a dropdown menu.
it: **Voce di menu Conti**: Clicca sulla voce "Conti" per espandere il menu a discesa.

source: **View or Create Account**: Select "View Account" or "Create Account" as per the requirement.
it: **Visualizza o Crea Conto**: Seleziona "Visualizza Conto" o "Crea Conto" in base alle necessità.

source: 6.2 Viewing all Accounts
it: 6.2 Visualizzazione di tutti i Conti

source: On the "View Accounts" page, accounts are displayed in a table format, providing a comprehensive overview of all existing accounts.
it: Nella pagina "Visualizza Conti", i conti sono visualizzati in formato tabella, fornendo una panoramica completa di tutti i conti esistenti.

source: Optional alt text for the image
it: Testo alternativo opzionale per l'immagine

source: 6.3 Create Account Form
it: 6.3 Modulo di Creazione Conto

source: The **Create Account** form allows users to add new accounts into the system. Below are the field descriptions along with their expected input values.
it: Il modulo **Crea Conto** consente agli utenti di aggiungere nuovi conti nel sistema. Di seguito sono riportate le descrizioni dei campi e i valori di input previsti.

source: Below are the field descriptions along with their expected input values:
it: Di seguito sono riportate le descrizioni dei campi e i valori di input previsti:

source: **Form Functionality**
it: **Funzionalità del Modulo**

source: This form is used to store and manage business accounts rather than individual contacts.
it: Questo modulo viene utilizzato per memorizzare e gestire conti aziendali piuttosto che contatti individuali.

source: **Industry selection** helps categorize businesses efficiently.
it: La **selezione dell'industria** aiuta a categorizzare le aziende in modo efficiente.

source: **Tags** provide additional segmentation options for easy filtering.
it: I **tag** offrono opzioni di segmentazione aggiuntive per un facile filtraggio.

source: The "Save" button finalizes the account creation process.
it: Il pulsante "Salva" finalizza il processo di creazione del conto.

source: 6.4 Managing Accounts
it: 6.4 Gestione dei Conti

source: PantaSys CRM provides comprehensive functionalities to manage accounts effectively. The **Accounts** function allows users to add new business accounts to the CRM system.
it: PantaSys CRM fornisce funzionalità complete per gestire i conti in modo efficace. La funzione **Conti** consente agli utenti di aggiungere nuovi conti aziendali al sistema CRM.

source: **Creating an Account**
it: **Creazione di un Conto**

source: To add a new account:
it: Per aggiungere un nuovo conto:

source: **Navigate to Accounts**: Click the "Accounts" button and expand the dropdown list.
it: **Navigare nei Conti**: Clicca sul pulsante "Conti" ed espandi l'elenco a discesa.

source: **Create Account**: Click the "Create Account" button.
it: **Crea Conto**: Clicca sul pulsante "Crea Conto".

source: **Fill in Details**: Complete the fields in the form.
it: **Compilare i Dettagli**: Compila i campi del modulo.

source: **Save**: Click "Save" to add the new account to the system.
it: **Salva**: Clicca "Salva" per aggiungere il nuovo conto al sistema.

source: **Viewing an Account**
it: **Visualizzazione di un Conto**

source: To view details of an existing account:
it: Per visualizzare i dettagli di un conto esistente:

source: **Navigate to View Account**: Access the "View Account" page.
it: **Navigare alla Visualizzazione Conto**: Accedi alla pagina "Visualizza Conto".

source: **Accounts Table**: Accounts are displayed in a table format with relevant details.
it: **Tabella dei Conti**: I conti sono visualizzati in formato tabella con dettagli rilevanti.

source: **View Icon**: Click the "View" icon in the Actions column corresponding to the desired account to see detailed information.
it: **Icona Visualizza**: Clicca sull'icona "Visualizza" nella colonna Azioni corrispondente al conto desiderato per vedere i dettagli.

source: **Updating an Account**
it: **Aggiornamento di un Conto**

source: To modify an existing account:
it: Per modificare un conto esistente:

source: **Edit Icon**: Locate the account to be updated and click the "Edit" icon.
it: **Icona Modifica**: Trova il conto da aggiornare e clicca sull'icona "Modifica".

source: **Modify Details**: Make the necessary changes in the form.
it: **Modifica Dettagli**: Apporta le modifiche necessarie nel modulo.

source: **Save**: Click "Save" to apply the updates.
it: **Salva**: Clicca "Salva" per applicare le modifiche.

source: **Deleting an Account**
it: **Eliminazione di un Conto**

source: To remove an account from the system:
it: Per rimuovere un conto dal sistema:

source: **Delete Icon**: Locate the account to be deleted and click the "Delete" icon.
it: **Icona Elimina**: Trova il conto da eliminare e clicca sull'icona "Elimina".

source: **Confirm Deletion**: Confirm the deletion when prompted to remove the account.
it: **Conferma Eliminazione**: Conferma l'eliminazione quando richiesto per rimuovere il conto.
