Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/activities.po
Languages: it

source: 7. Activities
it: 7. Attività

source: 7.1 Navigating to Activities
it: 7.1 Navigare nelle Attività

source: To access the **Activities** section:
it: Per accedere alla sezione **Attività**:

source: **Home Page**: Start from the PantaSys home page.
it: **Home Page**: Inizia dalla pagina principale di PantaSys.

source: **Sidebar Menu**: Locate the sidebar menu on the left-hand side.
it: **Menu laterale**: Trova il menu laterale sul lato sinistro.

source: **Activities Menu Item**: Click on the **Activities** menu item to expand a dropdown menu.
it: **Elemento del Menu Attività**: Fai clic sull'elemento del menu **Attività** per espandere un menu a discesa.

source: **View or Create Activity**: Select **View Activities** or **Create Activity** as per the requirement.
it: **Visualizza o Crea Attività**: Seleziona **Visualizza Attività** o **Crea Attività** a seconda delle necessità.

source: 7.2 Viewing all Activities
it: 7.2 Visualizzare tutte le Attività

source: On the **View Activities** page, activities are displayed in a table format, providing a comprehensive overview of all existing activities.
it: Nella pagina **Visualizza Attività**, le attività sono visualizzate in formato tabellare, fornendo una panoramica completa di tutte le attività esistenti.

source: Activities overview
it: Panoramica delle Attività

source: 7.3 Create Activity Form
it: 7.3 Modulo Crea Attività

source: The **Create Activity** form allows users to add a new activity into the system. Below are the field descriptions along with their expected input values.
it: Il modulo **Crea Attività** consente agli utenti di aggiungere una nuova attività nel sistema. Di seguito sono riportate le descrizioni dei campi insieme ai valori di input attesi.

source: Create Activity Form
it: Modulo Crea Attività

source: Below are the field descriptions and their expected inputs and functionality.
it: Di seguito sono riportate le descrizioni dei campi, i relativi input attesi e le funzionalità.

source: 7.4 Managing Activities
it: 7.4 Gestire le Attività

source: The PantaSys CRM provides comprehensive functionalities to manage Accounts effectively. The **Account** function allows users to add new business accounts to the CRM system.
it: Il CRM PantaSys offre funzionalità complete per gestire gli Account in modo efficace. La funzione **Account** consente agli utenti di aggiungere nuovi account aziendali al sistema CRM.

source: **Creating an Activity**
it: **Creare un'Attività**

source: To add a new activity:
it: Per aggiungere una nuova attività:

source: **Navigate to Activities**: Click the **Activities** button to expand a dropdown list.
it: **Naviga nelle Attività**: Fai clic sul pulsante **Attività** per espandere un elenco a discesa.

source: **Create Activity**: Click the **Create Activity** button.
it: **Crea Attività**: Fai clic sul pulsante **Crea Attività**.

source: **Fill in Details**: Complete the fields in the form.
it: **Compila i Dettagli**: Completa i campi nel modulo.

source: **Save**: Click **Save** to add the new activity to the system.
it: **Salva**: Fai clic su **Salva** per aggiungere la nuova attività al sistema.

source: **Viewing an Activity**
it: **Visualizzare un'Attività**

source: To view details of an existing activity:
it: Per visualizzare i dettagli di un'attività esistente:

source: **Navigate to View Activities**: Access the **View Activities** page.
it: **Naviga su Visualizza Attività**: Accedi alla pagina **Visualizza Attività**.

source: **Activity Table**: Activities are displayed in a table format with relevant details.
it: **Tabella Attività**: Le attività sono visualizzate in formato tabellare con i dettagli pertinenti.

source: **View Icon**: Click the **View** icon in the Actions column corresponding to the desired activity to see detailed information.
it: **Icona Visualizza**: Fai clic sull'icona **Visualizza** nella colonna Azioni corrispondente all'attività desiderata per vedere informazioni dettagliate.

source: Viewing an Activity
it: Visualizzare un'Attività

source: **Updating an Activity**
it: **Aggiornare un'Attività**

source: To modify an existing activity:
it: Per modificare un'attività esistente:

source: **Edit Icon**: Locate the activity to be updated and click the **Edit** icon.
it: **Icona Modifica**: Trova l'attività da aggiornare e fai clic sull'icona **Modifica**.

source: **Modify Details**: Make the necessary changes in the form.
it: **Modifica i Dettagli**: Apporta le modifiche necessarie nel modulo.

source: **Save**: Click **Save** to apply the updates.
it: **Salva**: Fai clic su **Salva** per applicare gli aggiornamenti.

source: **Deleting an Activity**
it: **Eliminare un'Attività**

source: To remove an activity from the system:
it: Per rimuovere un'attività dal sistema:

source: **Delete Icon**: Locate the activity to be deleted and click the **Delete** icon.
it: **Icona Elimina**: Trova l'attività da eliminare e fai clic sull'icona **Elimina**.

source: **Confirm Deletion**: Confirm the deletion when prompted to remove the activity.
it: **Conferma Eliminazione**: Conferma l'eliminazione quando richiesto per rimuovere l'attività.
