Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/contact.po
Languages: it

source: 5. Contacts
it: 5. Contatti

source: 5.1 Navigating to Contacts
it: 5.1 Navigazione ai Contatti

source: To access the "Contacts" section:
it: Per accedere alla sezione "Contatti":

source: **Home Page**: Start from the PantaSys home page.
it: **Pagina iniziale**: Inizia dalla pagina principale di PantaSys.

source: **Sidebar Menu**: Locate the sidebar menu on the left-hand side.
it: **Menu laterale**: Trova il menu laterale sul lato sinistro.

source: **Contacts Menu Item**: Click on the "Contacts" menu item to expand a dropdown menu.
it: **Voce del menu Contatti**: Fai clic sulla voce di menu "Contatti" per espandere un menu a discesa.

source: **View Contacts**: Select "View Contacts" to open the contacts management page.
it: **Visualizza Contatti**: Seleziona "Visualizza Contatti" per aprire la pagina di gestione dei contatti.

source: 5.2 Viewing all Contacts
it: 5.2 Visualizzare tutti i contatti

source: On the "View Contacts" page, contacts are displayed in a table format, providing a comprehensive overview of all existing contacts.
it: Alla pagina "Visualizza Contatti", i contatti sono visualizzati in un formato tabellare, offrendo una panoramica completa di tutti i contatti esistenti.

source: Optional alt text for the image
it: Testo alternativo opzionale per l'immagine

source: 5.3 Create Contact Form
it: 5.3 Modulo Crea Contatto

source: The **Create Contact** form allows users to add new contacts into the system. Below are the field descriptions along with their expected input values.
it: Il modulo **Crea Contatto** consente agli utenti di aggiungere nuovi contatti nel sistema. Di seguito sono riportate le descrizioni dei campi insieme ai relativi valori di input previsti.

source: Below are the field descriptions along with their expected input values:
it: Di seguito sono le descrizioni dei campi con i relativi valori di input previsti:

source: **Form Functionality**
it: **Funzionalità del Modulo**

source: This form is used to store detailed information about a contact.
it: Questo modulo viene utilizzato per memorizzare informazioni dettagliate su un contatto.

source: Dropdown selections help streamline data entry and prevent errors.
it: Le selezioni a discesa aiutano a semplificare l'inserimento dei dati e prevenire errori.

source: Users can categorize contacts using tags for better segmentation.
it: Gli utenti possono categorizzare i contatti utilizzando etichette per una migliore segmentazione.

source: The **Save** button finalizes the contact creation process.
it: Il pulsante **Salva** finalizza il processo di creazione del contatto.

source: 5.4 Managing Contacts
it: 5.4 Gestire i contatti

source: PantaSys CRM provides comprehensive functionalities to manage contacts effectively.
it: PantaSys CRM fornisce funzionalità complete per gestire i contatti efficacemente.

source: **Creating a Contact**
it: **Creare un contatto**

source: To add a new contact:
it: Per aggiungere un nuovo contatto:

source: **Navigate to Contacts**: Click the **Contacts** button and expand the dropdown list.
it: **Navigare ai contatti**: Fai clic sul pulsante **Contatti** e espandi la lista a discesa.

source: **Create Contact**: Click the **Create Contact** button.
it: **Crea Contatto**: Fai clic sul pulsante **Crea Contatto**.

source: **Fill in Details**: Complete the fields in the form.
it: **Compila i dettagli**: Completa i campi nel modulo.

source: **Save**: Click "Save" to add the new **contact** to the system.
it: **Salva**: Fai clic su "Salva" per aggiungere il nuovo **contatto** al sistema.

source: **Viewing a Contact**
it: **Visualizzare un contatto**

source: To view details of an existing contact:
it: Per visualizzare i dettagli di un contatto esistente:

source: **Navigate to View Contacts**: Access the **View Contacts** page.
it: **Naviga su Visualizza Contatti**: Accedi alla pagina **Visualizza Contatti**.

source: **Contacts Table**: Contacts are displayed in a table format with relevant details.
it: **Tabella dei contatti**: I contatti sono visualizzati in un formato tabellare con i dettagli rilevanti.

source: **View Icon**: Click the **View** icon in the Actions column corresponding to the desired contact to see detailed information.
it: **Icona Visualizza**: Fai clic sull'icona **Visualizza** nella colonna Azioni corrispondente al contatto desiderato per vedere informazioni dettagliate.

source: **Updating a Contact**
it: **Aggiornare un contatto**

source: To modify an existing contact:
it: Per modificare un contatto esistente:

source: **Edit Icon**: Locate the contact to be updated and click the **Edit** icon.
it: **Icona Modifica**: Trova il contatto da aggiornare e fai clic sull'icona **Modifica**.

source: **Modify Details**: Make the necessary changes in the form.
it: **Modifica i dettagli**: Apporta le modifiche necessarie nel modulo.

source: **Save**: Click **Save** to apply the updates.
it: **Salva**: Fai clic su **Salva** per applicare gli aggiornamenti.

source: **Deleting a Contact**
it: **Eliminare un contatto**

source: To remove a contact from the system:
it: Per rimuovere un contatto dal sistema:

source: **Delete Icon**: Locate the contact to be deleted and click the **Delete** icon.
it: **Icona Elimina**: Trova il contatto da eliminare e fai clic sull'icona **Elimina**.

source: **Confirm Deletion**: Confirm the deletion when prompted to remove the Contact.
it: **Conferma eliminazione**: Conferma l'eliminazione quando richiesto per rimuovere il Contatto.
