Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/crm.po
Languages: it

source: The CRM section includes tools for managing leads, calendars, and campaigns.
it: La sezione CRM include strumenti per la gestione di lead, calendari e campagne.

source: The CRM module enables efficient lead and customer management.
it: Il modulo CRM consente una gestione efficiente di lead e clienti.

source: Navigating to Leads
it: Navigare ai Lead

source: To access the "Leads" section:
it: Per accedere alla sezione "Lead":

source: On the **Home Page**, locate the **Sidebar Menu**.
it: Nella **Home Page**, trova il **Menu Laterale**.

source: Click on the **Leads** menu item. This will expand a dropdown menu.
it: Fai clic sulla voce di menu **Lead**. Questo espanderà un menu a discesa.

source: Select **View Leads** to open the leads management page.
it: Seleziona **Visualizza Lead** per aprire la pagina di gestione dei lead.

source: Viewing Leads
it: Visualizzare i Lead

source: Optional alt text for the image
it: Testo alternativo opzionale per l'immagine

source: **Leads**:
it: **Lead**:

source: **View Leads**: Displays a list of all existing leads.
it: **Visualizza Lead**: Mostra un elenco di tutti i lead esistenti.

source: **Create Lead**: Allows users to add new leads to the system.
it: **Crea Lead**: Consente agli utenti di aggiungere nuovi lead al sistema.

source: **Import Leads**: Facilitates the import of leads from external sources.
it: **Importa Lead**: Facilita l'importazione di lead da fonti esterne.

source: This section provides a detailed overview of the "Leads" feature, including navigation, CRUD operations, table columns, and additional functionalities.
it: Questa sezione fornisce una panoramica dettagliata della funzione "Lead", inclusi navigazione, operazioni CRUD, colonne della tabella e funzionalità aggiuntive.

source: Managing Leads
it: Gestire i Lead

source: Create a Lead
it: Creare un Lead

source: Navigate to the **View Leads** page.
it: Vai alla pagina **Visualizza Lead**.

source: Click the **Create CRM Contact** button.
it: Fai clic sul pulsante **Crea Contatto CRM**.

source: Fill in the required fields and click **Save.**
it: Compila i campi richiesti e fai clic su **Salva.**

source: View a Lead
it: Visualizzare un Lead

source: Leads are displayed in a table format with all relevant details.
it: I lead sono visualizzati in formato tabella con tutti i dettagli rilevanti.

source: Update a Lead
it: Aggiornare un Lead

source: On the **View Leads** page, locate the lead you want to modify.
it: Nella pagina **Visualizza Lead**, individua il lead che desideri modificare.

source: Click the **Edit** button in the **Actions** column.
it: Fai clic sul pulsante **Modifica** nella colonna **Azioni**.

source: Make the necessary changes and click **Save.**
it: Apporta le modifiche necessarie e fai clic su **Salva.**

source: Delete a Lead
it: Eliminare un Lead

source: On the **View Leads** page, locate the lead you want to delete.
it: Nella pagina **Visualizza Lead**, individua il lead che desideri eliminare.

source: Click the **Delete** button in the **Actions** column.
it: Fai clic sul pulsante **Elimina** nella colonna **Azioni**.

source: Confirm the deletion to remove the lead permanently.
it: Conferma l'eliminazione per rimuovere definitivamente il lead.

source: Lead Table Columns
it: Colonne della Tabella Lead

source: **Contact ID**: - A unique identifier assigned to each lead. - This column helps to differentiate between leads easily.
it: **ID Contatto**: - Un identificatore univoco assegnato a ciascun lead. - Questa colonna aiuta a distinguere facilmente tra i lead.

source: **Email**: - The email address of the lead. - This column allows users to view and verify contact information.
it: **Email**: - L'indirizzo email del lead. - Questa colonna consente agli utenti di visualizzare e verificare le informazioni di contatto.

source: **First Name**: - The first name of the lead. - This field provides clarity on the lead's identity.
it: **Nome**: - Il nome del lead. - Questo campo fornisce chiarezza sull'identità del lead.

source: **Last Name**: - The last name of the lead. - Together with the first name, it fully identifies the lead.
it: **Cognome**: - Il cognome del lead. - Insieme al nome, identifica completamente il lead.

source: **Phone Number**: - The contact phone number of the lead. - This column is used for direct communication with the lead.
it: **Numero di Telefono**: - Il numero di telefono di contatto del lead. - Questa colonna viene utilizzata per la comunicazione diretta con il lead.

source: **Tag**: - A label or keyword associated with the lead. - Tags can help categorize or filter leads for better management.
it: **Tag**: - Un'etichetta o una parola chiave associata al lead. - I tag possono aiutare a categorizzare o filtrare i lead per una migliore gestione.

source: **Created At**: - The date and time when the lead was created. - This field helps track when the lead was added.
it: **Creato il**: - La data e l'ora in cui il lead è stato creato. - Questo campo aiuta a tracciare quando il lead è stato aggiunto.

source: **Updated At**: - The date and time when the lead was last updated. - Useful for identifying recent changes.
it: **Aggiornato il**: - La data e l'ora dell'ultimo aggiornamento del lead. - Utile per identificare le modifiche recenti.

source: **CRM Campaign**: - A text column containing the name or type of CRM campaign associated with the lead. - This helps link leads to specific marketing campaigns.
it: **Campagna CRM**: - Una colonna testuale contenente il nome o il tipo di campagna CRM associata al lead. - Questo aiuta a collegare i lead a specifiche campagne di marketing.

source: **Lead Owner**: - A dropdown column allowing selection of the lead's owner. - The dropdown is searchable for convenience.
it: **Proprietario del Lead**: - Una colonna a discesa che consente di selezionare il proprietario del lead. - La colonna è ricercabile per comodità.

source: **Organization**: - The organization the lead is associated with. - This provides context on the lead's professional background.
it: **Organizzazione**: - L'organizzazione a cui il lead è associato. - Questo fornisce contesto sul background professionale del lead.

source: **Designation**: - The professional title or role of the lead within their organization. - Helps understand the lead’s position in their company.
it: **Designazione**: - Il titolo professionale o il ruolo del lead all'interno della loro organizzazione. - Aiuta a comprendere la posizione del lead nella loro azienda.

source: **Country**: - A searchable dropdown that provides a list of countries to select from. - Users can easily assign a country to the lead for regional tracking.
it: **Paese**: - Un menu a discesa ricercabile che fornisce un elenco di paesi tra cui scegliere. - Gli utenti possono facilmente assegnare un paese al lead per il tracciamento regionale.

source: **Lead Type**: - A dropdown containing predefined lead types. - Examples include "Prospect," "Customer," or "Partner."
it: **Tipo di Lead**: - Un menu a discesa contenente tipi di lead predefiniti. - Esempi includono "Prospetto," "Cliente," o "Partner."

source: **Product**: - The product or service associated with the lead. - This column helps link leads with specific offerings.
it: **Prodotto**: - Il prodotto o servizio associato al lead. - Questa colonna aiuta a collegare i lead a offerte specifiche.

source: **Lead Status**: - A dropdown containing predefined statuses for the lead. - Examples include "New," "In Progress," "Closed."
it: **Stato del Lead**: - Un menu a discesa contenente stati predefiniti per il lead. - Esempi includono "Nuovo," "In Corso," "Chiuso."

source: **Source**: - Indicates how the lead was acquired (e.g., "Website," "Referral," "Event"). - Helps track lead generation channels.
it: **Fonte**: - Indica come è stato acquisito il lead (ad esempio, "Sito Web," "Referenza," "Evento"). - Aiuta a tracciare i canali di generazione dei lead.

source: **Follow-up Date**: - A date and time column for scheduling follow-up actions. - Ensures timely communication with leads.
it: **Data di Follow-up**: - Una colonna con data e ora per programmare azioni di follow-up. - Garantisce una comunicazione tempestiva con i lead.
