Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/introduction.po
Languages: it

source: |project_name| CRM Documentation
it: Documentazione del CRM |project_name|

source: Introduction
it: Introduzione

source: |project_name| is a proprietary framework (GeneSys), designed to provide a highly flexible, scalable, and robust platform for various enterprise applications. It offers extensive REST API capabilities, allowing seamless communication between systems. Additionally, |project_name| supports integration with over multiple third-party applications, making it a powerful solution for businesses that require interoperability across multiple tools and services.
it: |project_name| è un framework proprietario (GeneSys), progettato per fornire una piattaforma altamente flessibile, scalabile e robusta per varie applicazioni aziendali. Offre ampie capacità REST API, consentendo una comunicazione senza interruzioni tra i sistemi. Inoltre, |project_name| supporta l'integrazione con numerose applicazioni di terze parti, rendendolo una soluzione potente per le aziende che richiedono interoperabilità tra vari strumenti e servizi.

source: This guide provides an overview of |project_name|, a platform designed to enhance business efficiency. It includes user management, lead tracking, case management, and communication tools such as WhatsApp integration and e-mail. The system provides an intuitive dashboard for monitoring business activities.
it: Questa guida fornisce una panoramica di |project_name|, una piattaforma progettata per migliorare l'efficienza aziendale. Include la gestione degli utenti, il tracciamento dei lead, la gestione dei casi e strumenti di comunicazione come l'integrazione di WhatsApp e l'e-mail. Il sistema offre una dashboard intuitiva per il monitoraggio delle attività aziendali.

source: Objective
it: Obiettivo

source: The goal of the |project_name| is to:
it: L'obiettivo di |project_name| è di:

source: Provide a **centralized CRM** for managing leads, contacts, and accounts.
it: Fornire un **CRM centralizzato** per la gestione di lead, contatti e account.

source: Seamless **Account Management**.
it: Gestione degli **Account** senza soluzione di continuità.

source: Streamline **customer support** through case management.
it: Ottimizzare il **supporto clienti** tramite la gestione dei casi.

source: Enable seamless communication using **WhatsApp integration and In-build one click e-mail feature**.
it: Abilitare una comunicazione fluida utilizzando l'**integrazione di WhatsApp e la funzione e-mail a un clic integrata**.

source: Offer an easy-to-use interface for tracking **daily user activity and sales metrics**.
it: Offrire un'interfaccia facile da usare per tracciare l'**attività quotidiana degli utenti e le metriche di vendita**.
