Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/login.po
Languages: it

source: 1. Accessing |project_name|
it: 1. Accedere a |project_name|

source: To access the **|project_name|**, follow these steps:
it: Per accedere a **|project_name|**, segui questi passaggi:

source: 1.1 Logging In
it: 1.1 Accesso

source: Optional alt text for the image
it: Testo alternativo opzionale per l'immagine

source: **Navigate to the Website** Open your preferred web browser and go to the **|project_name|** website.
it: **Naviga sul sito web** Apri il tuo browser web preferito e vai sul sito web di **|project_name|**.

source: **Login** Enter your credentials (**username** and **password**) in the login fields provided.
it: **Accesso** Inserisci le tue credenziali (**nome utente** e **password**) nei campi di login.

source: **Submit** Click the **"Sign In"** button to access the dashboard.
it: **Invia** Fai clic sul pulsante **"Accedi"** per accedere alla dashboard.

source: 1.2 Logging Out
it: 1.2 Disconnettersi

source: Navigate to the top right side of the page
it: Vai sulla parte superiore destra della pagina

source: You will see these three options
it: Vedrai queste tre opzioni
