Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/master_data.po
Languages: it

source: Master Data
it: Dati Master

source: Master Data refers to the core data essential to operations in a specific business or business unit.
it: I Dati Master si riferiscono ai dati fondamentali essenziali per le operazioni di un'attività o di un'unità aziendale.

source: The **Master Data** section in |project_name| provides tools for managing critical system data that is essential for platform functionality. It allows users with sufficient roles to manage keywords, translations, and other configurable system settings for optimal operation.
it: La sezione **Master Data** in |project_name| fornisce strumenti per gestire i dati critici del sistema che sono essenziali per il funzionamento della piattaforma. Consente agli utenti con i ruoli sufficienti di gestire parole chiave, traduzioni e altri parametri configurabili del sistema per un'operazione ottimale.

source: Navigating to Master Data
it: Navigare ai Dati Master

source: To access the **Master Data** section:
it: Per accedere alla sezione **Dati Master**:

source: **Go to the Home Page** of |project_name|.
it: **Vai alla Home Page** di |project_name|.

source: **Locate the Master Data** menu on the sidebar.
it: **Trova il menu Dati Master** nella barra laterale.

source: **Click on the Master Data menu item**, which will expand a dropdown list of available tools.
it: **Fai clic sull'elemento di menu Dati Master**, che espanderà un elenco a discesa degli strumenti disponibili.

source: Features of Master Data
it: Caratteristiche dei Dati Master

source: The Master Data section includes tools for:
it: La sezione Dati Master include strumenti per:

source: **Managing Keywords** – Useful for search optimization and categorization.
it: **Gestire le Parole Chiave** – Utile per l'ottimizzazione della ricerca e la categorizzazione.

source: **Handling Translations** – Supports multilingual capabilities to enhance user accessibility.
it: **Gestire le Traduzioni** – Supporta funzionalità multilingue per migliorare l'accessibilità per gli utenti.

source: 1. Keywords
it: 1. Parole Chiave

source: The **Keywords** module helps manage keywords for better search functionality and content categorization within |project_name|.
it: Il modulo **Keywords** aiuta a gestire le parole chiave per migliorare le funzionalità di ricerca e la categorizzazione dei contenuti all'interno di |project_name|.

source: Viewing Keywords
it: Visualizzare le Parole Chiave

source: Users can view a list of all existing keywords in a structured table format.
it: Gli utenti possono visualizzare un elenco di tutte le parole chiave esistenti in formato tabellare.

source: The table includes the following columns:
it: La tabella include le seguenti colonne:

source: **Keyword ID** – A unique identifier for the keyword.
it: **ID Parola Chiave** – Un identificatore unico per la parola chiave.

source: **Name** – The actual keyword text.
it: **Nome** – Il testo effettivo della parola chiave.

source: **Created At** – Timestamp of keyword creation.
it: **Creato Il** – Timestamp di creazione della parola chiave.

source: **Updated At** – Timestamp of last modification.
it: **Aggiornato Il** – Timestamp dell'ultima modifica.

source: Creating a New Keyword
it: Creare una Nuova Parola Chiave

source: To add a new keyword:
it: Per aggiungere una nuova parola chiave:

source: Navigate to **Master Data > Keywords**.
it: Vai su **Dati Master > Parole Chiave**.

source: Click on **Create Keyword**.
it: Fai clic su **Crea Parola Chiave**.

source: Enter the **Name** of the new keyword.
it: Inserisci il **Nome** della nuova parola chiave.

source: Click **Save** to add it to the system.
it: Fai clic su **Salva** per aggiungerla al sistema.

source: 2. Translations
it: 2. Traduzioni

source: The **Translations** module manages multilingual support, ensuring localized experiences for users in different regions.
it: Il modulo **Traduzioni** gestisce il supporto multilingue, garantendo esperienze localizzate per gli utenti in diverse regioni.

source: Viewing Translations
it: Visualizzare le Traduzioni

source: Users can view a list of all existing translations in a structured table format.
it: Gli utenti possono visualizzare un elenco di tutte le traduzioni esistenti in formato tabellare.

source: The table includes the following fields:
it: La tabella include i seguenti campi:

source: **Translation ID** – A unique identifier for the translation entry.
it: **ID Traduzione** – Un identificatore unico per la voce di traduzione.

source: **Key** – The key used for referencing the translation in the system.
it: **Chiave** – La chiave utilizzata per fare riferimento alla traduzione nel sistema.

source: **Created At** – Timestamp when the translation was added.
it: **Creato Il** – Timestamp quando la traduzione è stata aggiunta.

source: **Updated At** – Timestamp of the last update.
it: **Aggiornato Il** – Timestamp dell'ultimo aggiornamento.

source: Creating a New Translation
it: Creare una Nuova Traduzione

source: To add a new translation:
it: Per aggiungere una nuova traduzione:

source: Navigate to **Master Data > Translations**.
it: Vai su **Dati Master > Traduzioni**.

source: Click on **Create Translation**.
it: Fai clic su **Crea Traduzione**.

source: Enter the **Key** (reference text).
it: Inserisci la **Chiave** (testo di riferimento).

source: Click **Save** to store the translation.
it: Fai clic su **Salva** per memorizzare la traduzione.

source: Role-Based Access Control (RBAC)
it: Controllo Accessi Basato sui Ruoli (RBAC)

source: RBAC in |project_name| ensures secure and organized access management by assigning roles and permissions to users based on their responsibilities. It follows a hierarchical structure where roles define what actions a user can perform.
it: RBAC in |project_name| garantisce una gestione sicura e organizzata degli accessi assegnando ruoli e permessi agli utenti in base alle loro responsabilità. Segue una struttura gerarchica dove i ruoli definiscono quali azioni un utente può eseguire.

source: **Key Concepts of RBAC**
it: **Concetti Chiave di RBAC**

source: **Roles** – Define sets of permissions for different types of users (e.g., Manager, Sales-Rep, Tenant-Admin).
it: **Ruoli** – Definiscono set di permessi per diversi tipi di utenti (ad esempio, Manager, Sales-Rep, Tenant-Admin).

source: **Rules** – Optional conditions that restrict permissions based on context (e.g., a user can only edit their own records, a user can view leads assigned to him only).
it: **Regole** – Condizioni opzionali che limitano i permessi in base al contesto (ad esempio, un utente può solo modificare i propri record, un utente può visualizzare solo i lead assegnati a lui).

source: **Assignments** – Link roles to users dynamically, allowing flexible access control.
it: **Assegnazioni** – Collega i ruoli agli utenti in modo dinamico, consentendo un controllo degli accessi flessibile.

source: **Roles in |project_name|**
it: **Ruoli in |project_name|**

source: **Tenant-Admin**: Full control over tenant-level settings, user management, and configurations.
it: **Tenant-Admin**: Controllo completo delle impostazioni a livello di tenant, gestione utenti e configurazioni.

source: **Manager**: Can oversee operations, manage accounts, and assign tasks.
it: **Manager**: Può supervisionare le operazioni, gestire gli account e assegnare compiti.

source: **Accountant**: Can manage sales records etc.
it: **Contabile**: Può gestire i registri delle vendite, ecc.

source: **Sales-Rep/Support-Rep**: Limited access to leads, contacts, and opportunities.
it: **Sales-Rep/Support-Rep**: Accesso limitato a lead, contatti e opportunità.

source: **How RBAC Works in |project_name|**
it: **Come Funziona RBAC in |project_name|**

source: **Assign Roles to Users** : A Tenant-Admin can assign roles to users and manage permissions.
it: **Assegnare Ruoli agli Utenti**: Un Tenant-Admin può assegnare ruoli agli utenti e gestire i permessi.

source: **Define Permissions for Roles** : Permissions are linked to roles to specify what actions each role can perform.
it: **Definire Permessi per i Ruoli**: I permessi sono legati ai ruoli per specificare quali azioni ogni ruolo può eseguire.

source: **Restrict Access** : The application checks a user’s role and associated permissions before allowing them to perform specific actions.
it: **Limitare l'Accesso**: L'applicazione verifica il ruolo di un utente e i permessi associati prima di consentire l'esecuzione di azioni specifiche.

source: Additional Functionalities
it: Funzionalità Aggiuntive

source: The Master Data module ensures **consistency across the platform** by providing centralized management of key system elements.
it: Il modulo Dati Master garantisce **coerenza su tutta la piattaforma** fornendo una gestione centralizzata degli elementi chiave del sistema.

source: It integrates seamlessly with other |project_name| features, including **user management, leads, CRM, and campaign tools**.
it: Si integra perfettamente con altre funzionalità di |project_name|, inclusi **gestione utenti, lead, CRM e strumenti per le campagne**.

source: REST API endpoints are available for programmatic interaction with **Master Data**.
it: Sono disponibili endpoint REST API per l'interazione programmatica con i **Dati Master**.
