Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/rbac.po
Languages: it

source: Role-Based Access Control (RBAC)
it: Controllo Accessi Basato su Ruoli (RBAC)

source: |project_name| implements a role hierarchy to control access to various features and sections of the application. Below is the hierarchical structure of roles:
it: |project_name| implementa una gerarchia di ruoli per controllare l'accesso a varie funzionalità e sezioni dell'applicazione. Di seguito è riportata la struttura gerarchica dei ruoli:

source: Key Concepts
it: Concetti chiave

source: **Roles**
it: **Ruoli**

source: A "role" is a set of permissions grouped together.
it: Un "ruolo" è un insieme di permessi raggruppati insieme.

source: **Purpose**: Define what a user can do based on their role.
it: **Scopo**: Definire cosa un utente può fare in base al proprio ruolo.

source: **Permissions**
it: **Permessi**

source: A "permission" is a specific action a user is allowed to perform.
it: Un "permesso" è un'azione specifica che un utente può eseguire.

source: **Purpose**: Control access to particular features or actions in the application.
it: **Scopo**: Controllare l'accesso a determinate funzionalità o azioni nell'applicazione.

source: **Example**: Edit User, View Dashboard, Delete User.
it: **Esempio**: Modifica Utente, Visualizza Dashboard, Elimina Utente.

source: **Users**
it: **Utenti**

source: Individuals who use the application.
it: Individui che utilizzano l'applicazione.

source: **Purpose**: Users are assigned one role to define what they can access.
it: **Scopo**: Agli utenti viene assegnato un ruolo per definire a cosa possono accedere.

source: How RBAC Works
it: Come funziona l'RBAC

source: **Assign Roles to Users** :
it: **Assegna ruoli agli utenti** :

source: Each user is assigned one roles based on their responsibilities in the application.
it: A ogni utente viene assegnato un ruolo in base alle proprie responsabilità nell'applicazione.

source: **Define Permissions for Roles** :
it: **Definisci i permessi per i ruoli** :

source: Permissions are linked to roles to specify what actions each role can perform.
it: I permessi sono collegati ai ruoli per specificare quali azioni ogni ruolo può eseguire.

source: **Restrict Access** :
it: **Restringi l'accesso** :

source: The application checks a user’s role and associated permissions before allowing them to perform specific actions.
it: L'applicazione verifica il ruolo di un utente e i permessi associati prima di consentire loro di eseguire azioni specifiche.

source: Example Scenarios
it: Esempi di scenari

source: Managing a Blog
it: Gestione di un blog

source: **Admin**: Can create, edit, delete, and publish articles.
it: **Admin**: Può creare, modificare, eliminare e pubblicare articoli.

source: **Editor**: Can edit and publish articles but cannot delete them.
it: **Editor**: Può modificare e pubblicare articoli ma non eliminarli.

source: **Viewer**: Can only view articles.
it: **Visualizzatore**: Può solo visualizzare gli articoli.

source: E-Commerce Site
it: Sito di e-commerce

source: **Customer**: Can browse products, add items to a cart, and place orders.
it: **Cliente**: Può sfogliare i prodotti, aggiungere articoli al carrello e effettuare ordini.

source: **Manager**: Can manage products and view sales reports.
it: **Manager**: Può gestire i prodotti e visualizzare i report di vendita.

source: **Admin**: Has all permissions, including managing users and settings.
it: **Admin**: Ha tutti i permessi, inclusa la gestione di utenti e impostazioni.

source: Roles Hierarchy
it: Gerarchia dei ruoli

source: The |project_name| application uses a Role-Based Access Control (RBAC) system with the following hierarchy. Permissions and roles can be structured hierarchically, with higher roles inheriting permissions from lower roles.
it: L'applicazione |project_name| utilizza un sistema di Controllo Accessi Basato su Ruoli (RBAC) con la seguente gerarchia. Permessi e ruoli possono essere strutturati gerarchicamente, con i ruoli superiori che ereditano i permessi dai ruoli inferiori.

source: **Example**: An Tenant-Admin role might inherit permissions from the Manager Manager, Accountant, Sales-Rep, Support-Rep, Teacher, Affiliate, User, Guest.
it: **Esempio**: Un ruolo Tenant-Admin potrebbe ereditare i permessi da Manager, Contabile, Sales-Rep, Support-Rep, Insegnante, Affiliato, Utente, Ospite.

source: ``` TENANT-ADMIN ↓ MANAGER ↓ ACCOUNTANT , SALES-REP , SUPPORT-REP ```
it: ``` TENANT-ADMIN ↓ MANAGER ↓ CONTABILE , SALES-REP , SUPPORT-REP ```

source: **Tenant Admin**
it: **Amministratore Tenant**

source: Full access to all features and sections.
it: Accesso completo a tutte le funzionalità e sezioni.

source: Parent role for all other roles.
it: Ruolo principale per tutti gli altri ruoli.

source: Access to all features except login logs and system logs.
it: Accesso a tutte le funzionalità eccetto i log di accesso e i log di sistema.

source: **Accountant** - Access limited to the dashboard view only.
it: **Contabile** - Accesso limitato solo alla visualizzazione della dashboard.

source: **Sales-Rep** - Access to:
it: **Sales-Rep** - Accesso a:

source: Contact Requests (in Site section)
it: Richieste di contatto (nella sezione Sito)

source: Leads and Lead Calendar (in CRM section)
it: Lead e Calendario dei Lead (nella sezione CRM)

source: **Support-Rep** - Access to:
it: **Support-Rep** - Accesso a:

source: Access Control
it: Controllo degli accessi

source: This section provides a breakdown of role-based permissions and functionalities.
it: Questa sezione fornisce una suddivisione dei permessi e delle funzionalità basate sui ruoli.

source: **Tenant-Admin Access**:
it: **Accesso Tenant-Admin**:

source: Full access to all features, including: - Dashboard - Users - Roles - CRM (Leads, Calendar, Campaigns) - Contact Requests - Reviews - System Logs - Login Logs
it: Accesso completo a tutte le funzionalità, inclusi: - Dashboard - Utenti - Ruoli - CRM (Lead, Calendario, Campagne) - Richieste di contatto - Recensioni - Log di sistema - Log di accesso

source: **Manager Access**:
it: **Accesso Manager**:

source: Inherits Tenant-Admin permissions except for: - Login Logs - System Logs
it: Eredita i permessi di Tenant-Admin eccetto per: - Log di accesso - Log di sistema

source: **Accountant Access**:
it: **Accesso Contabile**:

source: Limited to: - Dashboard viewing only
it: Limitato a: - Solo visualizzazione della dashboard

source: **Sales-Rep and Support-Rep Access**:
it: **Accesso Sales-Rep e Support-Rep**:

source: Access to: - Dashboard - Contact Requests - Leads (Calendar, View Leads, Create Leads, Import Leads)
it: Accesso a: - Dashboard - Richieste di contatto - Lead (Calendario, Visualizza Lead, Crea Lead, Importa Lead)
