Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/roles.po
Languages: it

source: Roles
it: Ruoli

source: The Roles section allows for managing user roles within the system.
it: La sezione Ruoli consente di gestire i ruoli degli utenti all'interno del sistema.

source: The **Roles** feature under the **Master Data** section provides tools for managing user roles within the |project_name| application. Roles help define user permissions and access levels, enabling administrators to assign responsibilities effectively.
it: La funzionalità **Ruoli** sotto la sezione **Dati principali** fornisce strumenti per gestire i ruoli degli utenti all'interno dell'applicazione |project_name|. I ruoli aiutanoa definire i permessi e i livelli di accesso degli utenti, permettendo agli amministratori di assegnare le responsabilità in modo efficace.

source: Navigating to Roles
it: Navigare nella sezione Ruoli

source: To access the "Roles" section:
it: Per accedere alla sezione "Ruoli":

source: Navigate to the **Master Data > Roles** section.
it: Naviga nella sezione **Dati principali > Ruoli**.

source: Select **View Roles** to open the Roles management page.
it: Seleziona **Visualizza Ruoli** per aprire la pagina di gestione dei ruoli.

source: Roles Management
it: Gestione dei Ruoli

source: The **Roles** menu contains the following options:
it: Il menu **Ruoli** contiene le seguenti opzioni:

source: **View Roles**: Displays a list of all roles.
it: **Visualizza Ruoli**: Mostra un elenco di tutti i ruoli.

source: **Create Role**: Add new roles with custom permissions.
it: **Crea Ruolo**: Aggiungi nuovi ruoli con permessi personalizzati.

source: **Update Role**: Modify existing roles.
it: **Aggiorna Ruolo**: Modifica i ruoli esistenti.

source: **Delete Role**: Permanently remove roles.
it: **Elimina Ruolo**: Rimuovi i ruoli in modo permanente.

source: Viewing Roles
it: Visualizzare i Ruoli

source: To view existing roles:
it: Per visualizzare i ruoli esistenti:

source: Select **View Roles** from the dropdown menu.
it: Seleziona **Visualizza Ruoli** dal menu a discesa.

source: View Roles Table
it: Tabella dei Ruoli

source: A table listing all stored roles will appear, displaying the following columns:
it: Apparirà una tabella che elenca tutti i ruoli memorizzati, mostrando le seguenti colonne:

source: **Role ID**: A unique, auto-generated identifier for each role.
it: **ID Ruolo**: Un identificatore unico e generato automaticamente per ogni ruolo.

source: **Name**: The name of the role.
it: **Nome**: Il nome del ruolo.

source: **Description**: A brief description of the role.
it: **Descrizione**: Una breve descrizione del ruolo.

source: **Created At**: The date and time the role was created.
it: **Creato il**: La data e l'ora in cui è stato creato il ruolo.

source: **Updated At**: The date and time the role was last updated.
it: **Aggiornato il**: La data e l'ora in cui è stato aggiornato il ruolo.

source: **Actions**: Interactive icons to update, delete, or view detailed information about a role.
it: **Azioni**: Icone interattive per aggiornare, eliminare o visualizzare informazioni dettagliate su un ruolo.

source: Creating a Role
it: Creare un Ruolo

source: To create a new role:
it: Per creare un nuovo ruolo:

source: Select **Create Role** from the dropdown menu.
it: Seleziona **Crea Ruolo** dal menu a discesa.

source: Fill in the required fields: - **Name**: Enter a unique name for the role. - **Description**: Provide a brief description of the role.
it: Compila i campi richiesti: - **Nome**: Inserisci un nome unico per il ruolo. - **Descrizione**: Fornisci una breve descrizione del ruolo.

source: Click **Save** to store the new role.
it: Clicca su **Salva** per memorizzare il nuovo ruolo.

source: Create Role Form
it: Modulo per Creare un Ruolo

source: Updating a Role
it: Aggiornare un Ruolo

source: To update an existing role:
it: Per aggiornare un ruolo esistente:

source: Navigate to the **View Roles** page.
it: Naviga nella pagina **Visualizza Ruoli**.

source: Locate the role you want to modify.
it: Individua il ruolo che desideri modificare.

source: Click the **Edit** icon in the **Actions** column.
it: Clicca sull'icona **Modifica** nella colonna **Azioni**.

source: Update the necessary fields and click **Save**.
it: Aggiorna i campi necessari e clicca su **Salva**.

source: Deleting a Role
it: Eliminare un Ruolo

source: To delete an existing role:
it: Per eliminare un ruolo esistente:

source: Locate the role you want to delete.
it: Individua il ruolo che desideri eliminare.

source: Click the **Delete** icon in the **Actions** column.
it: Clicca sull'icona **Elimina** nella colonna **Azioni**.

source: Confirm the deletion to permanently remove the role.
it: Conferma l'eliminazione per rimuovere permanentemente il ruolo.
