Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/system.po
Languages: it

source: Prerequisites
it: Requisiti

source: Before accessing the system, users need:
it: Prima di accedere al sistema, gli utenti devono avere:

source: A valid username and password.
it: Un nome utente e una password validi.

source: Internet access and a compatible web browser (Chrome, Firefox, Edge).
it: Accesso a Internet e un browser web compatibile (Chrome, Firefox, Edge).

source: Appropriate user role permissions (Admin, Sales Rep, Support Agent).
it: Permessi di ruolo utente appropriati (Amministratore, Rappresentante Vendite, Agente di Supporto).

source: System Overview
it: Panoramica del sistema

source: Displays an overview of users, orders, revenue, and visitors.
it: Visualizza una panoramica degli utenti, ordini, ricavi e visitatori.

source: Includes a graphical daily user activity report.
it: Include un report grafico delle attività giornaliere degli utenti.

source: User Management
it: Gestione Utenti

source: **View Users** – Lists all registered users.
it: **Visualizza Utenti** – Elenca tutti gli utenti registrati.

source: **Create User** – Allows adding new users.
it: **Crea Utente** – Permette di aggiungere nuovi utenti.

source: **Charts** – Visual representation of user statistics.
it: **Grafici** – Rappresentazione visiva delle statistiche degli utenti.

source: Leads
it: Lead

source: **View Leads** – Access and track potential customers.
it: **Visualizza Lead** – Accedi e traccia i potenziali clienti.

source: **Create Lead** – Add new lead entries.
it: **Crea Lead** – Aggiungi nuove voci di lead.

source: Contacts
it: Contatti

source: **View Contacts** – Manage and update customer details.
it: **Visualizza Contatti** – Gestisci e aggiorna i dettagli dei clienti.

source: **Create Contact** – Add new contacts to the system.
it: **Crea Contatto** – Aggiungi nuovi contatti al sistema.

source: **Assign Contacts to Accounts** – Link contacts with business accounts.
it: **Assegna Contatti a Conti** – Collega i contatti con i conti aziendali.

source: **Manage Contact Information** – Update details such as phone, email, and address.
it: **Gestisci le informazioni di contatto** – Aggiorna dettagli come telefono, email e indirizzo.

source: **Track Communication History** – Maintain a log of interactions with each contact.
it: **Traccia la cronologia delle comunicazioni** – Mantieni un registro delle interazioni con ciascun contatto.

source: Accounts
it: Conti

source: **View Accounts** – Manage business accounts linked to contacts.
it: **Visualizza Conti** – Gestisci i conti aziendali collegati ai contatti.

source: **Create Account** – Register new business entities.
it: **Crea Account** – Registra nuove entità aziendali.

source: **Link Accounts to Contacts** – Connect multiple contacts to a single account.
it: **Collega Conti ai Contatti** – Collega più contatti a un singolo conto.

source: **Monitor Account Activities** – Track interactions, transactions, and notes related to an account.
it: **Monitora le Attività del Conto** – Traccia interazioni, transazioni e note relative a un conto.

source: **Manage Account Hierarchy** – Organize parent-child relationships between accounts.
it: **Gestisci la Gerarchia dei Conti** – Organizza le relazioni gerarchiche tra conti.

source: Opportunities
it: Opportunità

source: **View Opportunities** – Track business deals in progress.
it: **Visualizza Opportunità** – Traccia le trattative in corso.

source: **Create Opportunity** – Register new business opportunities.
it: **Crea Opportunità** – Registra nuove opportunità aziendali.

source: Cases
it: Casi

source: **View Cases** – Manage customer support requests.
it: **Visualizza Casi** – Gestisci le richieste di supporto clienti.

source: **Create Case** – Log new customer issues or complaints.
it: **Crea Caso** – Registra nuovi problemi o reclami dei clienti.

source: Activities
it: Attività

source: **View Activities** – Monitor scheduled tasks and meetings.
it: **Visualizza Attività** – Monitora le attività pianificate e le riunioni.

source: **Create Activity** – Add new activities related to leads, contacts, or accounts.
it: **Crea Attività** – Aggiungi nuove attività relative a lead, contatti o conti.

source: Communication & Engagement
it: Comunicazione & Coinvolgimento

source: **WhatsApp** – Integrated messaging for lead management.
it: **WhatsApp** – Messaggistica integrata per la gestione dei lead.

source: **Email** – Enables email communication with leads and clients.
it: **Email** – Abilita la comunicazione via email con lead e clienti.

source: **Campaign** – Manage marketing and outreach campaigns.
it: **Campagna** – Gestisci campagne di marketing e outreach.

source: Security & Compliance
it: Sicurezza & Conformità

source: **Role-Based Access Control (RBAC)** ensures restricted access based on user roles.
it: **Controllo Accesso Basato sul Ruolo (RBAC)** garantisce accesso ristretto in base ai ruoli utente.

source: **Data Encryption** protects customer and business data.
it: **Crittografia dei Dati** protegge i dati dei clienti e dell'azienda.

source: **Audit Logs** track user activities within the system.
it: **Log di Audit** tracciano le attività degli utenti all'interno del sistema.
