Repository: eunders/genesys-ms-readthedocs
Catalog: source/locale/*/LC_MESSAGES/users.po
Languages: it

source: Users
it: Utenti

source: The \"Users\" module focuses on account management, enabling administrators to control access, assign roles, and maintain user details.
it: Il modulo \"Utenti\" si concentra sulla gestione degli account, permettendo agli amministratori di controllare l'accesso, assegnare ruoli e mantenere i dettagli degli utenti.

source: The Users section focuses on user account management. Administrators can:
it: La sezione Utenti si concentra sulla gestione degli account utente. Gli amministratori possono:

source: **Create User**: Add new users with specific roles.
it: *Crea Utente*: Aggiungi nuovi utenti con ruoli specifici.

source: **View Users**: Display a list of users in a table format.
it: *Visualizza Utenti*: Mostra un elenco degli utenti in formato tabella.

source: **Update User**: Modify user details and roles.
it: *Aggiorna Utente*: Modifica i dettagli e i ruoli dell'utente.

source: **Delete User**: Remove users from the system.
it: *Elimina Utente*: Rimuovi gli utenti dal sistema.

source: The "Users" module focuses on user account management, empowering administrators to control access, assign roles, and maintain user details. Refer to the **Users** section for detailed instructions on managing users.
it: Il modulo "Utenti" si concentra sulla gestione degli account utente, dando agli amministratori il potere di controllare l'accesso, assegnare ruoli e mantenere i dettagli degli utenti. Consulta la sezione **Utenti** per istruzioni dettagliate sulla gestione degli utenti.

source: Navigating to Users
it: Navigare verso gli Utenti

source: To access the "Users" section:
it: Per accedere alla sezione "Utenti":

source: On the **Home Page**, locate the **Sidebar Menu**.
it: Sulla **Pagina principale**, trova il **Menu laterale**.

source: Click on the **Users** menu item. This will expand a dropdown menu.
it: Clicca sulla voce di menu **Utenti**. Questo espanderà un menu a discesa.

source: Select **View Users** to open the user management page.
it: Seleziona **Visualizza Utenti** per aprire la pagina di gestione utenti.

source: Optional alt text for the image
it: Testo alternativo opzionale per l'immagine

source: **Actions**
it: **Azioni**

source: **View Icon**: Opens a detailed view of the user.
it: **Icona di Visualizzazione**: Apre una visualizzazione dettagliata dell'utente.

source: **Delete Icon**: Removes the user from the system.
it: **Icona di Eliminazione**: Rimuove l'utente dal sistema.

source: **Update Icon**: Opens the user form for editing.
it: **Icona di Aggiornamento**: Apre il modulo utente per la modifica.

source: The following fields are available in the **Create/Update User** form:
it: I seguenti campi sono disponibili nel modulo **Crea/Aggiorna Utente**:

source: **Email**: - The email address of the user. This field allows users to provide their contact information.
it: **Email**: - L'indirizzo email dell'utente. Questo campo consente agli utenti di fornire le loro informazioni di contatto.

source: **Phone**: - The phone number of the user. Useful for direct communication or verification purposes.
it: **Telefono**: - Il numero di telefono dell'utente. Utile per la comunicazione diretta o per scopi di verifica.

source: **Username**: - The username selected by the user. This field is used for login and identification.
it: **Nome utente**: - Il nome utente selezionato dall'utente. Questo campo è utilizzato per il login e l'identificazione.

source: **Password**: - The password associated with the user account. Ensures account security.
it: **Password**: - La password associata all'account utente. Garantisce la sicurezza dell'account.

source: **Role**: - The user’s role in the system, Helps assign appropriate permissions and responsibilities.
it: **Ruolo**: - Il ruolo dell'utente nel sistema, aiuta ad assegnare i permessi e le responsabilità appropriati.

source: The options are following: Tenant-Admin, Manager, Accountant, Sales-Rep, Support-Rep, Teacher, Affiliate, User, Guest.
it: Le opzioni sono: Tenant-Admin, Manager, Accountant, Sales-Rep, Support-Rep, Teacher, Affiliate, User, Guest.

source: **First Name**: - The first name of the user. Provides clarity on the user’s identity.
it: **Nome**: - Il nome dell'utente. Fornisce chiarezza sull'identità dell'utente.

source: **Last Name**: - The last name of the user. Completes the user’s full name.
it: **Cognome**: - Il cognome dell'utente. Completa il nome completo dell'utente.

source: **Gender**: - The user’s gender, e.g., Male, Female, Other. Used for demographic categorization.
it: **Genere**: - Il genere dell'utente, ad esempio Maschio, Femmina, Altro. Utilizzato per la categorizzazione demografica.

source: **Address**: - The user’s address. Used for delivery purposes.
it: **Indirizzo**: - L'indirizzo dell'utente. Utilizzato per scopi di consegna.

source: **City**: - The city part of the address. Specifies the user's location within a country.
it: **Città**: - La parte dell'indirizzo relativa alla città. Specifica la posizione dell'utente all'interno di un paese.

source: **Country**: - The country part of the address. Essential for delivery categorization. The options are list of countries.
it: **Paese**: - La parte dell'indirizzo relativa al paese. Essenziale per la categorizzazione delle consegne. Le opzioni includono un elenco di paesi.

source: **Zip Code**: - The postal code for the address. Ensures accurate delivery.
it: **CAP**: - Il codice postale dell'indirizzo. Garantisce una consegna accurata.

source: **Save Button**: A button to save the user information.Submits the form for processing.
it: **Pulsante Salva**: Un pulsante per salvare le informazioni dell'utente. Invia il modulo per l'elaborazione.

source: Each field helps in managing and organizing the user's information effectively.
it: Ogni campo aiuta a gestire e organizzare efficacemente le informazioni dell'utente.

source: Create a User
it: Crea un Utente

source: Navigate to the **View Users** page.
it: Vai alla pagina **Visualizza Utenti**.

source: Click the **Create User** button.
it: Clicca sul pulsante **Crea Utente**.

source: Fill in the required fields and click **Save.**
it: Compila i campi richiesti e clicca su **Salva.**

source: View a User
it: Visualizza un Utente

source: Users are displayed in a table format with all relevant details.
it: Gli utenti sono visualizzati in formato tabella con tutti i dettagli rilevanti.

source: Update a User
it: Aggiorna un Utente

source: On the **View Users** page, locate the user you want to modify.
it: Sulla pagina **Visualizza Utenti**, trova l'utente che desideri modificare.

source: Click the **Edit** button in the **Actions** column.
it: Clicca sul pulsante **Modifica** nella colonna **Azioni**.

source: Make the necessary changes and click **Save.**
it: Apporta le modifiche necessarie e clicca su **Salva.**

source: Delete a User
it: Elimina un Utente

source: On the **View Users** page, locate the user you want to delete.
it: Sulla pagina **Visualizza Utenti**, trova l'utente che desideri eliminare.

source: Click the **Delete** button in the **Actions** column.
it: Clicca sul pulsante **Elimina** nella colonna **Azioni**.

source: Confirm the deletion to remove the user permanently.
it: Conferma l'eliminazione per rimuovere definitivamente l'utente.
